const data = [
    {
        title: "Проводим консультацию",
        body: `Влечет за собой процесс внедрения и модернизации приоритизации разума над эмоциями. В рамках спецификации современных стандартов, некоторые особенности внутренней политики будут объективно рассмотрены соответствующими инстанциями. А также представители современных социальных резервов, инициированные исключительно синтетически, ограничены исключительно образом мышления. Являясь всего лишь частью общей картины, реплицированные с зарубежных источников, современные исследования подвергнуты целой серии независимых исследований. Кстати, стремящиеся вытеснить традиционное производство, нанотехнологии освещают чрезвычайно интересные особенности картины в целом, однако конкретные выводы, разумеется, призваны к ответу.`,
        img: "assets/img/work.png",
    },
    {
        title: "Составляем смету",
        body: `Внедрения и модернизации приоритизации разума над эмоциями. В рамках спецификации современных стандартов, некоторые особенности внутренней политики будут объективно рассмотрены соответствующими инстанциями. А также представители современных социальных резервов, инициированные исключительно синтетически, ограничены исключительно образом мышления. Являясь всего лишь частью общей картины, реплицированные с зарубежных источников, современные исследования подвергнуты целой серии независимых исследований.`,
        img: "assets/img/work2.png",
    },
    {
        title: "Привлекаем подрядчиков",
        body: `Идейные соображения высшего порядка, а также новая модель организационной деятельности требует анализа прогресса профессионального сообщества. Высокий уровень вовлечения представителей целевой аудитории является четким доказательством простого факта: высококачественный прототип будущего проекта напрямую зависит от дальнейших направлений развития. Разнообразный и богатый опыт говорит нам, что новая модель организационной деятельности говорит о возможностях системы массового участия. Принимая во внимание показатели успешности, постоянное информационно-пропагандистское обеспечение нашей деятельности позволяет выполнить важные задания по разработке прогресса профессионального сообщества.`,
        img: "assets/img/work3.png",
    },
    {
        title: "Инспектируем все этапы работ",
        body: `Высокий уровень вовлечения представителей целевой аудитории является четким доказательством простого факта: высококачественный прототип будущего проекта напрямую зависит от дальнейших направлений развития. Разнообразный и богатый опыт говорит нам, что новая модель организационной деятельности говорит о возможностях системы массового участия. Принимая во внимание показатели успешности, постоянное информационно-пропагандистское обеспечение нашей деятельности позволяет.`,
        img: "assets/img/work4.png",
    },
];

const buttons = document.querySelectorAll(".work__step-btn");
const title = document.querySelector(".work__text-title");
const p = document.querySelector(".work__text-p");
const img = document.querySelector(".work__img");

buttons.forEach((btn) => {
    let info = data[btn.getAttribute("data-step") - 1];
    btn.onclick = () => {
        buttons.forEach(a=>a.classList.remove("work__step-active"));
        btn.classList.add("work__step-active");
        title.innerText = info.title;
        p.innerText = info.body;
        img.src = info.img;
    };
});
